//-------------- PROBLEM 01-07 --------------//
//       https://t.me/hse_walkthrough        //
//---------------- Editorial ----------------//
//Для решения задачи достаточно заметить, что//
//операция взятия K младших бит числа N      //
//эквивалентна побитовому сдвигу этого числа //
//на M-K(M = количеству бит в переменной)    //
//влево, а затем вправо.                     //
//В задаче 32-битные числа, то есть M = 32   //
//-------------------------------------------//

//Мной решено было скрыть код решения этой задачи
//для собственной безопасности.