//-------------- PROBLEM 01-14 --------------//
//       https://t.me/hse_walkthrough        //
//---------------- Editorial ----------------//
//Для решения задачи будем поддерживать      //
//два максимума и минимума при считывании    //
//чисел. Легко заметить, что максимальное    //
//произведение - наибольшее из произведений  //
//максимумов и минимумов. В случае равенства //
//чисел, следует вывести минимумы, ведь их   //
//сумма точно меньше суммы максимумов.       //
//Также важно при подсчете произведения      //
//использовать 64-битную переменную, ведь    //
//произведение может превосходить 2^31-1.    //
//-------------------------------------------//
 
//Мной решено было скрыть код решения этой задачи
//для собственной безопасности.