//-------------- PROBLEM 01-16 --------------//
//       https://t.me/hse_walkthrough        //
//---------------- Editorial ----------------//
//Для решения задачи достаточно заметить, что//
//точка пересечения медиан лежит в центре    //
//тяжести (он же барицентр и цетроид)        //
//треугольника. Формула координат центра     //
//тяжести плоского треугольника xC, yC:      //
//xC = (x1+x2+x3)/3  yC = (y1+y2+y3)/3       //
//где x1,y1 x2,y2 x3,y3 - координаты вершин  //
//рассматриваемого треугольника.             //
//-------------------------------------------//

//Мной было решено скрыть код решения этой задачи
//для собственной безопасности