//-------------- PROBLEM 01-18 --------------//
//       https://t.me/hse_walkthrough        //
//---------------- Editorial ----------------//
//Для решения задачи, будем рассматривать    //
//полубайты (в англоговорящих сообществах их //
//называют "nibble") введенного числа.       //
//Их будет 4: n0, n1, n2, n3                 //
//Заметим, что в числе, представляющем       //
//транспонированную матрицу, 0-й полубайт    //
//будет представлять собой конкатенацию      //
//(склейку) 0-х(в данном случае наиболее     //
//старших) битов всех 4-х исходных полубайтов//
//Аналогично для 1,2,3 полубайтов: они будут //
//представлять собой "склейку" 1,2,3-х бит   //
//исходных полубайтов соответственно.        //
//-------------------------------------------//
 
//Мной решено было скрыть код решения этой задачи
//для собственной безопасности.